export default class PlayerData {
  constructor() {
    this.stockChesses = [
      "chess_1",
      "chess_2",
      "chess_3",
      "chess_4",
      "chess_5",
      "chess_6",
      "chess_7",
      "chess_8",
      "chess_9",
      "chess_10"
    ];
    this.player1_ChessList = [
      "chess_1",
      "chess_2",
      "chess_3",
      "chess_4",
      "chess_5"
    ];
    this.player2_ChessList = [
      "chess_6",
      "chess_7",
      "chess_8",
      "chess_9",
      "chess_10"
    ]
    //初期の配置で使用
    this.player1_Arr = [
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0]
    ];
    this.player1Auto_Arr = [
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [1,2,3,4,5,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0]
    ];
    //初期の配置で使用
    this.player2_Arr = [
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0]
    ];
    this.player2Auto_Arr = [
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0],
      [1,2,3,4,5,0],
      [0,0,0,0,0,0],
      [0,0,0,0,0,0]
    ];


  }
}